jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
/*
 * Copyright (C) 2009 Jon Howell (jonh@jonh.net) and Jeremy Elson
 * (jelson@gmail.com).
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "core/hal.h"
#include "core/hardware.h"
#include "core/logging.h"
#include "periph/uart/uart_hal.h"
#include "stm32.h"

#include "core/dma.h"

/*
 * USE_RX_DMA_FOR_CHIP: chip has enough DMA channels to dedicate one to
 * UART RX (G0/G4). Smaller F-family chips use per-char RXNE interrupts
 * because their fixed-map DMA controllers don't have a spare channel
 * for every UART.
 */
#if defined(RULOS_ARM_stm32g0) || defined(RULOS_ARM_stm32g4) || \
    defined(RULOS_ARM_stm32h5)
#define USE_RX_DMA_FOR_CHIP 1
#else
#define USE_RX_DMA_FOR_CHIP 0
#endif

//////////////////////////////////////////////////////////////////////////////

typedef struct {
  // housekeeping
  bool initted;
  bool rx_gpio_initted;
  bool tx_gpio_initted;

  // RULOS HAL API: the upcall to get more data and the user data for that
  // callback
  uint8_t uart_id;
  void *user_data;

  // tx
  hal_uart_next_sendbuf_cb next_sendbuf_cb;

  // rx
  hal_uart_receive_cb rx_cb;
  char *rx_buf;
  // buflen we're given by the layer above, divided by two: size of each half
  size_t rx_half_buflen;
  bool rx_cb_ready;    // has the previous call to rx_cb completed?
  bool rx_data_ready;  // have we received an idle interrupt?

  // rx--interrupt mode only
  char *rx_curr_base_buf;  // points to rx_buf, or halfway into rx_buf
  size_t rx_bytes_stored;  // number of bytes received

  // RULOS DMA channel handles (allocated in hal_uart_init). rx_dma_ch
  // only exists on families that use DMA for RX (USE_RX_DMA_FOR_CHIP =
  // G0/G4); on F0/F1/F3 the field is compiled out.
  rulos_dma_channel_t *tx_dma_ch;
#if USE_RX_DMA_FOR_CHIP
  rulos_dma_channel_t *rx_dma_ch;
  uint32_t rx_dma_processed_pos;  // cursor into circular RX buffer
#endif
  // Base address of the peripheral's TX data register. Cached so the
  // tc_callback can re-arm the next transfer from ISR context.
  volatile void *usart_tdr;

  // statistics
  uint32_t tot_ints;
  uint32_t tot_rx_bytes;
  uint32_t tot_tx_bytes;
  uint32_t dropped_rx_bytes;
  uint32_t frame_errors;
  uint32_t parity_errors;
  uint32_t noise_errors;
  uint32_t overruns;
  uint32_t idle_ints;
  uint16_t min_chars_per_rx_isr;
  uint16_t max_chars_per_rx_isr;
  uint16_t max_chars_per_tx_batch;
  uint16_t max_chars_per_rx_batch;
} stm32_uart_t;

/// Configuration

typedef struct {
  // general
  USART_TypeDef *instance;
  IRQn_Type instance_irqn;

  // rx
  gpio_pin_t rx_pin;
  uint32_t rx_altfunc;

  // tx
  gpio_pin_t tx_pin;
  uint32_t tx_altfunc;

  // Logical DMA request identifiers; the RULOS DMA core translates
  // these to hardware channel assignments at init time. rx_dma_req
  // is only meaningful on families that use DMA for RX.
  rulos_dma_request_t tx_dma_req;
#if USE_RX_DMA_FOR_CHIP
  rulos_dma_request_t rx_dma_req;
#endif
} stm32_uart_config_t;

static void on_usart_interrupt(uint8_t uart_id);
static void config_gpio(const stm32_uart_config_t *config, bool rx);

///// pin selections

// rulos uart 0
#ifndef RULOS_UART0_RX_PIN
#define RULOS_UART0_RX_PIN GPIO_A10
#endif

#ifndef RULOS_UART0_TX_PIN
#define RULOS_UART0_TX_PIN GPIO_A9
#endif

// rulos uart 1
#ifndef RULOS_UART1_RX_PIN
#define RULOS_UART1_RX_PIN GPIO_A3
#endif

#ifndef RULOS_UART1_TX_PIN
#define RULOS_UART1_TX_PIN GPIO_A2
#endif

// rulos uart 2
#ifndef RULOS_UART2_RX_PIN
#define RULOS_UART2_RX_PIN GPIO_B9
#endif

#ifndef RULOS_UART2_TX_PIN
#define RULOS_UART2_TX_PIN GPIO_B2
#endif

// rulos uart 3
#ifndef RULOS_UART3_RX_PIN
#define RULOS_UART3_RX_PIN GPIO_A1
#endif

#ifndef RULOS_UART3_TX_PIN
#define RULOS_UART3_TX_PIN GPIO_A0
#endif

// rulos uart 4
#ifndef RULOS_UART4_RX_PIN
#define RULOS_UART4_RX_PIN GPIO_B1
#endif

#ifndef RULOS_UART4_TX_PIN
#define RULOS_UART4_TX_PIN GPIO_B0
#endif

// rulos uart 5
#ifndef RULOS_UART5_RX_PIN
#define RULOS_UART5_RX_PIN GPIO_A5
#endif

#ifndef RULOS_UART5_TX_PIN
#define RULOS_UART5_TX_PIN GPIO_A4
#endif



///////////// stm32h5

#if defined(RULOS_ARM_stm32h5)

// DMA IRQ handlers are owned by the RULOS DMA core (core/dma.c).
void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_pin = RULOS_UART0_RX_PIN,
        .rx_altfunc = GPIO_AF7_USART1,

        .tx_pin = RULOS_UART0_TX_PIN,
        .tx_altfunc = GPIO_AF7_USART1,

        .rx_dma_req = RULOS_DMA_REQ_USART1_RX,
        .tx_dma_req = RULOS_DMA_REQ_USART1_TX,
    },
};

///////////// stm32c0

#elif defined(RULOS_ARM_stm32c0)

// DMA IRQ handlers are owned by the RULOS DMA core (core/dma.c).
void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_pin = RULOS_UART0_RX_PIN,
        .rx_altfunc = GPIO_AF1_USART1,

        .tx_pin = RULOS_UART0_TX_PIN,
        .tx_altfunc = GPIO_AF1_USART1,

        .tx_dma_req = RULOS_DMA_REQ_USART1_TX,
    },
};

///////////// stm32f0

#elif defined(RULOS_ARM_stm32f0)

// DMA IRQ handlers are owned by the RULOS DMA core (core/dma.c).
void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_pin = RULOS_UART0_RX_PIN,
        .rx_altfunc = GPIO_AF1_USART1,

        .tx_pin = RULOS_UART0_TX_PIN,
        .tx_altfunc = GPIO_AF1_USART1,

        .tx_dma_req = RULOS_DMA_REQ_USART1_TX,
    },
};

///////////// stm32f1

