jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
#elif defined(RULOS_ARM_stm32f1)

// DMA IRQ handlers are owned by the RULOS DMA core (core/dma.c).
void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,
        .rx_pin = RULOS_UART0_RX_PIN,
        .tx_pin = RULOS_UART0_TX_PIN,

        .tx_dma_req = RULOS_DMA_REQ_USART1_TX,
    },
};

///////////// stm32f3

#elif defined(RULOS_ARM_stm32f3)

// DMA IRQ handlers are owned by the RULOS DMA core (core/dma.c).
void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_pin = RULOS_UART0_RX_PIN,
        .rx_altfunc = GPIO_AF7_USART1,

        .tx_pin = RULOS_UART0_TX_PIN,
        .tx_altfunc = GPIO_AF7_USART1,

        .tx_dma_req = RULOS_DMA_REQ_USART1_TX,
    },
};

///////////// stm32g0

#elif defined(RULOS_ARM_stm32g0)

// G0 DMA channels are allocated dynamically by the RULOS DMA core
// (core/dma.c). No more hand-maintained (uart, dma channel) mapping
// tables or UART_SURRENDER_* hacks. The allocator picks the first
// free DMA channel when each UART's hal_uart_init runs, and the
// DMAMUX routes the peripheral request there.

void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

// USART peripheral IRQ handlers below handle RXNE / IDLE / error flags
// (see on_usart_interrupt). They are unrelated to DMA; DMA IRQs are
// owned by core/dma.c. On G0B1, USART2 shares its IRQ line with LPUART2
// and USART3/4/5/6 share with LPUART1, so the handlers dispatch to
// all of them in one go -- on_usart_interrupt early-exits for UARTs
// that aren't initialized.

#if defined(STM32G0B1xx)
#define USART2_IRQn USART2_LPUART2_IRQn
void USART2_LPUART2_IRQHandler() {
  on_usart_interrupt(1);
}

void USART3_4_5_6_LPUART1_IRQHandler() {
  on_usart_interrupt(2);
  on_usart_interrupt(3);
  on_usart_interrupt(4);
  on_usart_interrupt(5);
}
#else
void USART2_IRQHandler() {
  on_usart_interrupt(1);
}
#endif

static const stm32_uart_config_t stm32_uart_config[] = {
    {
      // rulos uart 0
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_pin = RULOS_UART0_RX_PIN,
#define GPIO_A10 123
#if RULOS_UART0_RX_PIN == GPIO_A10
        .rx_altfunc = GPIO_AF1_USART1,
#else
        .rx_altfunc = GPIO_AF0_USART1,
#endif
#undef GPIO_A10

        .tx_pin = RULOS_UART0_TX_PIN,
#define GPIO_A9 123
#if RULOS_UART0_TX_PIN == GPIO_A9
        .tx_altfunc = GPIO_AF1_USART1,
#else
        .tx_altfunc = GPIO_AF0_USART1,
#endif
#undef GPIO_A9

        .rx_dma_req = RULOS_DMA_REQ_USART1_RX,
        .tx_dma_req = RULOS_DMA_REQ_USART1_TX,
    },
    {
      // rulos uart 1
        .instance = USART2,
        .instance_irqn = USART2_IRQn,
        .rx_pin = RULOS_UART1_RX_PIN,
        .rx_altfunc = GPIO_AF1_USART2,
        .tx_pin = RULOS_UART1_TX_PIN,
        .tx_altfunc = GPIO_AF1_USART2,
        .rx_dma_req = RULOS_DMA_REQ_USART2_RX,
        .tx_dma_req = RULOS_DMA_REQ_USART2_TX,
    },
#ifdef USART3
    {
      // rulos uart 2
        .instance = USART3,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_pin = RULOS_UART2_RX_PIN,
        .rx_altfunc = GPIO_AF4_USART3,
        .tx_pin = RULOS_UART2_TX_PIN,
        .tx_altfunc = GPIO_AF4_USART3,
        .rx_dma_req = RULOS_DMA_REQ_USART3_RX,
        .tx_dma_req = RULOS_DMA_REQ_USART3_TX,
    },
#endif
#ifdef USART4
    {
      // rulos uart 3
        .instance = USART4,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_pin = RULOS_UART3_RX_PIN,
        .rx_altfunc = GPIO_AF4_USART4,
        .tx_pin = RULOS_UART3_TX_PIN,
        .tx_altfunc = GPIO_AF4_USART4,
        .rx_dma_req = RULOS_DMA_REQ_USART4_RX,
        .tx_dma_req = RULOS_DMA_REQ_USART4_TX,
    },
#endif
#ifdef USART5
    {
      // rulos uart 4
        .instance = USART5,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_pin = RULOS_UART4_RX_PIN,
#define GPIO_B1 123
#if RULOS_UART4_RX_PIN == GPIO_B1
        .rx_altfunc = GPIO_AF8_USART5,
#else
        .rx_altfunc = GPIO_AF3_USART5,
#endif
#undef GPIO_B1
        .tx_pin = RULOS_UART4_TX_PIN,
        .tx_altfunc = GPIO_AF3_USART5,
        .rx_dma_req = RULOS_DMA_REQ_USART5_RX,
        .tx_dma_req = RULOS_DMA_REQ_USART5_TX,
    },
#endif
#ifdef USART6
    {
      // rulos uart 5
        .instance = USART6,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_pin = RULOS_UART5_RX_PIN,
        .rx_altfunc = GPIO_AF3_USART6,
        .tx_pin = RULOS_UART5_TX_PIN,
        .tx_altfunc = GPIO_AF3_USART6,
        .rx_dma_req = RULOS_DMA_REQ_USART6_RX,
        .tx_dma_req = RULOS_DMA_REQ_USART6_TX,
    },
#endif
};

///////////// stm32g4

#elif defined(RULOS_ARM_stm32g4)

void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

// DMA IRQ handlers are owned by the RULOS DMA core (core/dma.c).

static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_pin = RULOS_UART0_RX_PIN,
        .rx_altfunc = GPIO_AF7_USART1,

        .tx_pin = RULOS_UART0_TX_PIN,
        .tx_altfunc = GPIO_AF7_USART1,

        .rx_dma_req = RULOS_DMA_REQ_USART1_RX,
        .tx_dma_req = RULOS_DMA_REQ_USART1_TX,
    },
};

/////////////////////////////////////////

#else
#error "Tell the UART code about your chip's UART."
#include <stophere>
#endif

// Eventually this should be conditional depending on what kind of
// chip you have
#define NUM_UARTS (sizeof(stm32_uart_config) / sizeof(stm32_uart_config[0]))
static stm32_uart_t g_stm32_uarts[NUM_UARTS] = {};

/*
 * RX DMA is used when the chip family has enough DMA channels to
 * dedicate one to UART RX. On those families every configured UART
 * uses RX DMA (there's no "polled RX on a family with DMA" mixed
 * mode).
 */
#if USE_RX_DMA_FOR_CHIP
#define USART_USING_RX_DMA(config) (true)
#else
#define USART_USING_RX_DMA(config) (false)
#endif

///////////////////// reception /////////////////////////////

static void on_rx_buffer_full(uint8_t uart_id, stm32_uart_t *u,
                              const stm32_uart_config_t *c);
static char *switch_rx_buffers(stm32_uart_t *u);
static void rx_send_up(uint8_t uart_id, stm32_uart_t *u, char *buf,
                       size_t len);

//// Receiving: DMA Version

