jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
#if USE_RX_DMA_FOR_CHIP

/*
 * CIRCULAR-mode RX DMA. DMA runs continuously over the full RX buffer
 * (2 * rx_half_buflen bytes), wrapping automatically. HT fires at the
 * halfway point, TC fires at the wrap. The IDLE interrupt reads partial
 * progress without stopping DMA. No gap, no lost bytes.
 *
 * Mirrors the timestamper's circular input-capture DMA architecture
 * (see on_dma_ht / on_dma_tc / flush_dma_captures in timestamper.c).
 */
static void hal_uart_on_rx_dma_ht(void *user_data);
static void hal_uart_on_rx_dma_tc(void *user_data);

static void hal_uart_start_rx_dma(stm32_uart_t *u,
                                  const stm32_uart_config_t *config) {
  u->rx_dma_processed_pos = 0;
  LL_USART_EnableDMAReq_RX(config->instance);
  rulos_dma_start(u->rx_dma_ch,
                  (volatile void *)LL_USART_DMA_GetRegAddr(
                      config->instance, LL_USART_DMA_REG_DATA_RECEIVE),
                  u->rx_buf, 2 * u->rx_half_buflen);
}

// Shared helper for HT and TC callbacks: deliver bytes from
// rx_dma_processed_pos up to `boundary`, then advance the cursor
// to `next_pos`. Runs in DMA ISR context; DMA never stops.
static void rx_dma_deliver(uint8_t uart_id, uint32_t boundary,
                           uint32_t next_pos) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  if (!u->initted) {
    return;
  }
  u->tot_ints++;

  uint32_t last = u->rx_dma_processed_pos;
  if (last >= boundary) {
    // Already processed (periodic flush got here first). Just advance.
    u->rx_dma_processed_pos = next_pos;
    return;
  }

  size_t len = boundary - last;
  u->tot_rx_bytes += len;
  u->rx_dma_processed_pos = next_pos;

  if (u->rx_cb_ready) {
    rx_send_up(uart_id, u, u->rx_buf + last, len);
  } else {
    u->dropped_rx_bytes += len;
  }
}

static void hal_uart_on_rx_dma_ht(void *user_data) {
  uint8_t uart_id = (uint8_t)(uintptr_t)user_data;
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  rx_dma_deliver(uart_id, u->rx_half_buflen, u->rx_half_buflen);
}

static void hal_uart_on_rx_dma_tc(void *user_data) {
  uint8_t uart_id = (uint8_t)(uintptr_t)user_data;
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  rx_dma_deliver(uart_id, 2 * u->rx_half_buflen, 0);
}

#else  // USE_RX_DMA_FOR_CHIP

static void hal_uart_start_rx_dma(stm32_uart_t *u,
                                  const stm32_uart_config_t *config) {
}

#endif  // USE_RX_DMA_FOR_CHIP

//// Receiving: Per-Char Interrupt Version

static void hal_uart_start_rx_interrupt(stm32_uart_t *u,
                                        const stm32_uart_config_t *config) {
  LL_USART_EnableIT_RXNE(config->instance);
}

static void receive_char_int(uint8_t uart_id, stm32_uart_t *u,
                             const stm32_uart_config_t *config, char c) {
  // store the character
  u->rx_curr_base_buf[u->rx_bytes_stored] = c;
  u->rx_bytes_stored++;
  u->tot_rx_bytes++;

  // if the half-buffer has filled, make an upcall
  if (u->rx_bytes_stored == u->rx_half_buflen) {
    on_rx_buffer_full(uart_id, u, config);
  }
}

static size_t get_rx_stored_chars_int(uint8_t uart_id, stm32_uart_t *u,
                                      const stm32_uart_config_t *c) {
  return u->rx_bytes_stored;
}

//// Receiving: shared between DMA and Per-Char

static char *switch_rx_buffers(stm32_uart_t *u) {
  char *oldbuf = u->rx_curr_base_buf;
  if (oldbuf == u->rx_buf) {
    u->rx_curr_base_buf += u->rx_half_buflen;
  } else {
    u->rx_curr_base_buf = u->rx_buf;
  }
  u->rx_bytes_stored = 0;
  u->rx_data_ready = false;
  return oldbuf;
}

static void launch_next_rx(stm32_uart_t *u, const stm32_uart_config_t *config) {
  // launch a read on that buffer
  if (USART_USING_RX_DMA(config)) {
    hal_uart_start_rx_dma(u, config);
  } else {
    hal_uart_start_rx_interrupt(u, config);
  }
}

static void rx_send_up(uint8_t uart_id, stm32_uart_t *u, char *buf,
                       size_t len) {
  assert(u->rx_cb_ready);
  if (len > 0) {
    u->rx_cb_ready = false;
    u->rx_cb(uart_id, u->user_data, buf, len);
    if (len > u->max_chars_per_rx_batch) {
      u->max_chars_per_rx_batch = len;
    }
  }
}

// Maybe flush the RX buffer -- if there's data, and the upper layer is ready to
// receive
static void maybe_flush_rx_buf(uint8_t uart_id, stm32_uart_t *u,
                               const stm32_uart_config_t *c) {
  if (!u->rx_cb_ready) {
    return;
  }

  if (!u->rx_data_ready) {
    return;
  }

#if USE_RX_DMA_FOR_CHIP
  if (USART_USING_RX_DMA(c)) {
    // Circular-mode DMA flush: read the current write position without
    // stopping DMA, clamp to the current half-boundary (HT/TC own
    // transitions), and deliver whatever's new. Mirrors the timestamper's
    // flush_dma_captures pattern.
    __disable_irq();
    uint32_t buflen = 2 * u->rx_half_buflen;
    uint32_t remaining = rulos_dma_get_remaining(u->rx_dma_ch);
    uint32_t current_pos = buflen - remaining;
    if (current_pos >= buflen) {
      current_pos = 0;  // CNDTR reads 0 right at wrap
    }

    // Never cross a half-boundary — HT/TC callbacks handle those.
    uint32_t last = u->rx_dma_processed_pos;
    uint32_t limit = (last < u->rx_half_buflen) ? u->rx_half_buflen : buflen;
    if (current_pos > limit) {
      current_pos = limit;
    }

    size_t len = 0;
    if (current_pos > last) {
      len = current_pos - last;
      u->tot_rx_bytes += len;
      u->rx_dma_processed_pos = current_pos;
    }
    __enable_irq();

    u->rx_data_ready = false;
    if (len > 0) {
      rx_send_up(uart_id, u, u->rx_buf + last, len);
    }
    return;
  }
#endif

  // Per-char interrupt path (F0/F1/F3/C0/H5).
  size_t len = get_rx_stored_chars_int(uart_id, u, c);
  char *oldbuf = switch_rx_buffers(u);
  launch_next_rx(u, c);
  rx_send_up(uart_id, u, oldbuf, len);
}

static void on_rx_buffer_full(uint8_t uart_id, stm32_uart_t *u,
                              const stm32_uart_config_t *c) {
  // RX buffer is full, so we better be done processing the other one! Otherwise
  // we have to drop it.
  if (!u->rx_cb_ready) {
    // uh oh! we can't send the buffer up because the previous upcall is still
    // outstanding. no choice but to lose the data.
    u->dropped_rx_bytes += u->rx_half_buflen;
    u->rx_bytes_stored = 0;
  } else {
    char *oldbuf = switch_rx_buffers(u);
    rx_send_up(uart_id, u, oldbuf, u->rx_half_buflen);
  }
  launch_next_rx(u, c);
}

