jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
void hal_uart_start_rx(uint8_t uart_id, hal_uart_receive_cb rx_cb, void *buf,
                       size_t buflen) {
  /*
   * RX is initialized lazily: TX-only users of a UART never pay the
   * cost of an RX DMA channel or an RX GPIO setup. This function is
   * the single entry point that flips a UART into receive mode --
   * called once on first use, idempotent on subsequent calls.
   *
   * Note: we use the LL libraries (not the HAL) for the RX interrupt
   * path. The HAL libraries don't fit the "receive forever, one
   * character at a time" pattern RULOS wants -- they want a total
   * length up front and shut down when it's reached.
   */
  assert(uart_id < NUM_UARTS);
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
  if (!u->rx_gpio_initted) {
    config_gpio(config, true);
    u->rx_gpio_initted = true;
  }

#if USE_RX_DMA_FOR_CHIP
  // Lazily allocate the RX DMA channel on first start_rx. Callers that
  // only use TX never call this function and so never allocate an RX
  // channel. Subsequent calls to hal_uart_start_rx (e.g. to swap the
  // callback or buffer) reuse the existing channel.
  if (u->rx_dma_ch == NULL) {
    const rulos_dma_config_t rx_cfg = {
        .request = config->rx_dma_req,
        .direction = RULOS_DMA_DIR_PERIPH_TO_MEM,
        .mode = RULOS_DMA_MODE_CIRCULAR,
        .periph_width = RULOS_DMA_WIDTH_BYTE,
        .mem_width = RULOS_DMA_WIDTH_BYTE,
        .periph_increment = false,
        .mem_increment = true,
        .priority = RULOS_DMA_PRIORITY_MEDIUM,
        .tc_callback = hal_uart_on_rx_dma_tc,
        .ht_callback = hal_uart_on_rx_dma_ht,
        .user_data = (void *)(uintptr_t)uart_id,
    };
    u->rx_dma_ch = rulos_dma_alloc(&rx_cfg);
    if (u->rx_dma_ch == NULL) {
      __builtin_trap();
    }
  }
#endif

  u->rx_cb = rx_cb;
  u->rx_buf = buf;
  u->rx_curr_base_buf = u->rx_buf;
  u->rx_half_buflen = buflen / 2;
  u->rx_cb_ready = true;

  // If the hardware supports a UART FIFO, enable it
#ifdef LL_USART_ISR_RXNE_RXFNE
  LL_USART_EnableFIFO(config->instance);
#endif

  // clear spurious char that might be sitting in the rx register
  LL_USART_ReceiveData8(config->instance);

  // Enable the idle interrupt so we can flush rx buffers upwards when each
  // message ends
  LL_USART_ClearFlag_IDLE(config->instance);
  LL_USART_EnableIT_IDLE(config->instance);
  launch_next_rx(u, config);
}

static void on_usart_interrupt(uint8_t uart_id) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *c = &stm32_uart_config[uart_id];
  if (!u->initted) {
    return;
  }

  u->tot_ints++;

  // if this uart is expecting to rx, and a character arrived, add it to the rx
  // buffer
  if (u->rx_buf) {
      int num_read = 0;
      while (u->rx_buf && LL_USART_IsActiveFlag_RXNE(c->instance)) {
        // note: we have to read the character whether or not we send it anywhere;
        // reading the char is what clears the interrupt
        num_read++;
        receive_char_int(uart_id, u, c, LL_USART_ReceiveData8(c->instance));
      }

      // If we read anything, update some statistics
      if (num_read > 0) {
        if (num_read > u->max_chars_per_rx_isr) {
          u->max_chars_per_rx_isr = num_read;
        }
        if (u->min_chars_per_rx_isr == 0 || num_read < u->min_chars_per_rx_isr) {
          u->min_chars_per_rx_isr = num_read;
        }
      }
  }

  // on idle interrupt, flush the rx buffers upwards
  if (LL_USART_IsActiveFlag_IDLE(c->instance)) {
    LL_USART_ClearFlag_IDLE(c->instance);
    u->idle_ints++;
    u->rx_data_ready = true;
    maybe_flush_rx_buf(uart_id, u, c);
  }

  // handle RX errors by clearing flags and updating statistics
  if (LL_USART_IsActiveFlag_FE(c->instance)) {
    LL_USART_ClearFlag_FE(c->instance);
    u->frame_errors++;
  }
  if (LL_USART_IsActiveFlag_PE(c->instance)) {
    LL_USART_ClearFlag_PE(c->instance);
    u->parity_errors++;
  }
  if (LL_USART_IsActiveFlag_NE(c->instance)) {
    LL_USART_ClearFlag_NE(c->instance);
    u->noise_errors++;
  }
  if (LL_USART_IsActiveFlag_ORE(c->instance)) {
    LL_USART_ClearFlag_ORE(c->instance);
    u->overruns++;
  }

}

void hal_uart_rx_cb_done(uint8_t uart_id) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *c = &stm32_uart_config[uart_id];

  rulos_irq_state_t irq = hal_start_atomic();
  assert(!u->rx_cb_ready);
  u->rx_cb_ready = true;
  maybe_flush_rx_buf(uart_id, u, c);
  hal_end_atomic(irq);
}

/////// transmission

static void maybe_launch_next_tx(stm32_uart_t *uart) {
  assert(uart->next_sendbuf_cb != NULL);

  // Ask the layer above for the next buffer to send by calling the "send ready"
  // callback
  const char *buf;
  uint16_t len;
  uart->next_sendbuf_cb(uart->uart_id, uart->user_data, &buf, &len);

  if (len == 0) {
    // tx train complete!
    uart->next_sendbuf_cb = NULL;
  } else {
    // Start the transfer
    rulos_dma_start(uart->tx_dma_ch, uart->usart_tdr, (void *)buf, len);
    uart->tot_tx_bytes += len;
    if (len > uart->max_chars_per_tx_batch) {
      uart->max_chars_per_tx_batch = len;
    }
  }
}

// TC callback from the RULOS DMA core. Runs in DMA IRQ context. The
// user_data pointer encodes the RULOS uart_id.
static void hal_uart_on_tx_dma_tc(void *user_data) {
  uint8_t uart_id = (uint8_t)(uintptr_t)user_data;
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  if (!u->initted) {
    return;
  }
  // Re-arm if there's more data queued upstream.
  if (u->next_sendbuf_cb != NULL) {
    maybe_launch_next_tx(u);
  }
}

void hal_uart_start_send(uint8_t uart_id, hal_uart_next_sendbuf_cb cb) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  if (!u->tx_gpio_initted) {
    const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
    config_gpio(config, false);
    u->tx_gpio_initted = true;
  }
  assert(u->next_sendbuf_cb == NULL);
  u->next_sendbuf_cb = cb;
  maybe_launch_next_tx(u);
}

///// initialization

// We configure the GPIO only on-demand, i.e. configure the rx pin on the first
// rx and the tx pin on the first tx. This makes it easy to do half-duplex,
// e.g. use the tx pin for something else if you only plan to receive on the
// uart.
static void config_gpio(const stm32_uart_config_t *config, bool rx) {
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

  if (rx) {
    GPIO_InitStruct.Pin = config->rx_pin.pin;
#if !defined(RULOS_ARM_stm32f1)
    GPIO_InitStruct.Alternate = config->rx_altfunc;
#endif
    HAL_GPIO_Init(config->rx_pin.port, &GPIO_InitStruct);
  } else {
    GPIO_InitStruct.Pin = config->tx_pin.pin;
#if !defined(RULOS_ARM_stm32f1)
    GPIO_InitStruct.Alternate = config->tx_altfunc;
#endif
    HAL_GPIO_Init(config->tx_pin.port, &GPIO_InitStruct);
  }
}

void hal_uart_init(uint8_t uart_id, uint32_t baud,
                   void *user_data /* for both rx and tx upcalls */,
                   size_t *max_tx_len /* OUT */) {
  assert(uart_id < NUM_UARTS);
  stm32_uart_t *uart = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
  uart->initted = true;
  uart->uart_id = uart_id;
  uart->user_data = user_data;
  *max_tx_len = 65535;

  // Note: RULOS HAL uarts are numbered starting from 0.
  // STM32 UARTs are numbered starting from 1.

  // Enable USART clock
  switch (uart_id) {
#ifdef USART1
    case 0:
      __HAL_RCC_USART1_CLK_ENABLE();
      break;
#endif

#ifdef USART2
    case 1:
      __HAL_RCC_USART2_CLK_ENABLE();
      break;
#endif

#ifdef USART3
    case 2:
      __HAL_RCC_USART3_CLK_ENABLE();
      break;
#endif

#ifdef USART4
    case 3:
      __HAL_RCC_USART4_CLK_ENABLE();
      break;
#endif

