jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
#ifdef USART5
    case 4:
      __HAL_RCC_USART5_CLK_ENABLE();
      break;
#endif

#ifdef USART6
    case 5:
      __HAL_RCC_USART6_CLK_ENABLE();
      break;
#endif
    default:
      assert(false);
      break;
  }

  // Configure USART via the LL layer.
  LL_USART_Disable(config->instance);
  LL_USART_InitTypeDef usart_init = {
#if defined(RULOS_ARM_stm32c0) || defined(RULOS_ARM_stm32g0) || \
    defined(RULOS_ARM_stm32g4) || defined(RULOS_ARM_stm32h5)
      // PrescalerValue is a modern-era field. F0/F1/F3 predate the
      // USART prescaler and don't have it in LL_USART_InitTypeDef.
      .PrescalerValue = LL_USART_PRESCALER_DIV1,
#endif
      .BaudRate = baud,
      .DataWidth = LL_USART_DATAWIDTH_8B,
      .StopBits = LL_USART_STOPBITS_1,
      .Parity = LL_USART_PARITY_NONE,
      .TransferDirection = LL_USART_DIRECTION_TX_RX,
      .HardwareFlowControl = LL_USART_HWCONTROL_NONE,
      .OverSampling = LL_USART_OVERSAMPLING_16,
  };
  if (LL_USART_Init(config->instance, &usart_init) != SUCCESS) {
    __builtin_trap();
  }
  LL_USART_Enable(config->instance);

  // Cache the TDR address so the TX DMA path can reach it without a
  // config struct lookup on every transmit. F1 is the odd one out:
  // its USART has a single DR register for both TX and RX, so
  // LL_USART_DMA_GetRegAddr() takes no direction argument.
#if defined(RULOS_ARM_stm32f1)
  uart->usart_tdr =
      (volatile void *)LL_USART_DMA_GetRegAddr(config->instance);
#else
  uart->usart_tdr = (volatile void *)LL_USART_DMA_GetRegAddr(
      config->instance, LL_USART_DMA_REG_DATA_TRANSMIT);
#endif

  // Allocate a RULOS DMA channel for TX. The core layer handles
  // channel selection, DMAMUX programming, and IRQ wiring.
  const rulos_dma_config_t tx_cfg = {
      .request = config->tx_dma_req,
      .direction = RULOS_DMA_DIR_MEM_TO_PERIPH,
      .mode = RULOS_DMA_MODE_NORMAL,
      .periph_width = RULOS_DMA_WIDTH_BYTE,
      .mem_width = RULOS_DMA_WIDTH_BYTE,
      .periph_increment = false,
      .mem_increment = true,
      .priority = RULOS_DMA_PRIORITY_LOW,
      .tc_callback = hal_uart_on_tx_dma_tc,
      .user_data = (void *)(uintptr_t)uart_id,
  };
  uart->tx_dma_ch = rulos_dma_alloc(&tx_cfg);
  if (uart->tx_dma_ch == NULL) {
    __builtin_trap();
  }

  // RX DMA channel allocation (for families that use RX DMA) is
  // deferred to hal_uart_start_rx so that TX-only users don't consume
  // a DMA channel they'll never need. Small-pool families (G031, F1
  // high-density) have only 5-7 DMA channels to share across every
  // peripheral, so saving one per TX-only UART is material.

  // Wire the UART's TX-empty signal to the DMA request line. Set once
  // at init and left on for the life of the UART; the DMA layer
  // controls whether a transfer is active via channel enable.
  LL_USART_EnableDMAReq_TX(config->instance);

  // Set up USART peripheral interrupt
  HAL_NVIC_SetPriority(config->instance_irqn, 1, 0);
  HAL_NVIC_EnableIRQ(config->instance_irqn);
}

void hal_uart_log_stats(uint8_t uart_id) {
  assert(uart_id < NUM_UARTS);
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  (void)u;

  LOG("stats for UART %u", uart_id);
  LOG(" total rx: %lu", u->tot_rx_bytes);
  LOG(" total tx: %lu", u->tot_tx_bytes);
  LOG(" frame_errors: %lu", u->frame_errors);
  LOG(" parity_errors: %lu", u->parity_errors);
  LOG(" noise_errors: %lu", u->noise_errors);
  LOG(" overruns: %lu", u->overruns);
  LOG(" dropped rx bytes: %lu", u->dropped_rx_bytes);
#ifdef LL_USART_ISR_RXNE_RXFNE
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
  (void)config;
  LOG(" rx fifo: %lu", LL_USART_GetRXFIFOThreshold(config->instance));
#endif
  LOG(" min isr chars: %u", u->min_chars_per_rx_isr);
  LOG(" max isr chars: %u", u->max_chars_per_rx_isr);
}
